# Вывести на экран числа от -N до N
number = int(input('Enter start number: '))
for i in range(-number, number + 1):
    print(i)