# Реализовать алгоритм перемешивания списка. 


import random


numbers = [1,2,33,4,5,65,7,8,9]

random.shuffle(numbers)
print(numbers)