# Задать список из N элементов, заполненных числами из [-N, N].
# Найти произведение элементов на указанных позициях.
# Позиции хранятся в файле file.txt в одной строке одно число.


number = [-4, -3, -2, -1, 0, 1, 2, 3, 4]


with open(r'D:\GitHub\Python practic\GB_Tasks\Lesson_2\files\text.txt', 'r') as data:
    # firstNumber = int(input)
    # secondNumber = int(input)
    # print(firstNumber)
    for i in data:
        print(i)


# path = r'D:\GitHub\Python practic\GB_Tasks\Lesson_2\files\text.txt', 'r'
